Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32F769I-DISCO.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                            |I2C1|I2C2|I2C3|I2C4|SPI1 |SPI2 |SPI3 |SPI4 |SPI5 |SPI6 |USART1|USART2|USART3|USART6|ADC1 |TIM (PWM)                                 |USB       |RCC       |SYS        
PA0 , // |B_USER [B1]                            |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN0 |+TIM2_CH1 *TIM5_CH1                       |          |          |           
PA1 , // |RMII_REF_CLK [LAN8742A-CZ-TR_REFCLK0]  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN1 |+TIM2_CH2 *TIM5_CH2                       |          |          |           
PA2 , // |RMII_MDIO [LAN8742A-CZ-TR_MDIO]        |    |    |    |    |     |     |     |     |     |     |      |+TX   |      |      |*IN2 |+TIM9_CH1 *TIM2_CH3 +TIM5_CH3             |          |          |           
PA3 , // |ULPI_D0 [USB3320C-EZK_D0]              |    |    |    |    |     |     |     |     |     |     |      |+RX   |      |      |*IN3 |*TIM2_CH4 +TIM5_CH4 +TIM9_CH2             |          |          |           
PA4 , // |ARD_A1                                 |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN4 |                                          |          |          |           
PA5 , // |ULPI_CLK [USB3320C-EZK_CLKOUT]         |    |    |    |    |+SCK |     |     |     |     |+SCK |      |      |      |      |*IN5 |+TIM8_CH1N +TIM2_CH1                      |          |          |           
PA6 , // |ARD_A0                                 |    |    |    |    |+MISO|     |     |     |     |+MISO|      |      |      |      |*IN6 |+TIM3_CH1 +TIM13_CH1                      |          |          |           
PA7 , // |RMII_CRS_DV [LAN8742A-CZ-TR_CRS_DV]    |    |    |    |    |+MOSI|     |     |     |     |+MOSI|      |      |      |      |*IN7 |+TIM8_CH1N +TIM14_CH1 +TIM3_CH2 +TIM1_CH1N|          |          |           
PA8 , // |CEC_CLK [TP2]                          |    |    |*SCL|    |     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH1                                 |          |          |           
PA9 , // |VCP_TX [STM32F103CBT6_PA3]             |    |    |    |    |     |+SCK |     |     |     |     |+TX   |      |      |      |     |*TIM1_CH2                                 |          |          |           
PA10, // |VCP_RX                                 |    |    |    |    |     |     |     |     |     |     |+RX   |      |      |      |     |*TIM1_CH3                                 |          |          |           
PA11, // |SPI2_NSS                               |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH4                                 |*OTG_FS_DM|          |           
PA12, // |ARD_D13/SCK                            |    |    |    |    |     |*SCK |     |     |     |     |      |      |      |      |     |                                          |*OTG_FS_DP|          |           
PA13, // |SWDIO                                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |*JTMS-SWDIO
PA14, // |SWCLK                                  |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |*JTCK-SWCLK
PA15, // |CEC                                    |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM2_CH1                                 |          |          |*JTDI      
PB0 , // |ULPI_D1 [USB3320C-EZK_D1]              |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN8 |+TIM8_CH2N +TIM3_CH3 *TIM1_CH2N           |          |          |           
PB1 , // |ULPI_D2 [USB3320C-EZK_D2]              |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN9 |+TIM3_CH4 *TIM1_CH3N +TIM8_CH3N           |          |          |           
PB2 , // |                                       |    |    |    |    |     |     |+MOSI|     |     |     |      |      |      |      |     |                                          |          |          |           
PB3 , // |uSD_D2                                 |    |    |    |    |*SCK |     |*SCK |     |     |*SCK |      |      |      |      |     |*TIM2_CH2                                 |          |          |*JTDO-SWO  
PB4 , // |uSD_D3                                 |    |    |    |    |*MISO|     |*MISO|     |     |*MISO|      |      |      |      |     |*TIM3_CH1                                 |          |          |*JTRST     
PB5 , // |ULPI_D7 [USB3320C-EZK_D7]              |    |    |    |    |*MOSI|     |*MOSI|     |     |+MOSI|      |      |      |      |     |*TIM3_CH2                                 |          |          |           
PB6 , // |QSPI_NCS [N25Q128A13EF840E_S]          |+SCL|    |    |+SCL|     |     |     |     |     |     |*TX   |      |      |      |     |*TIM4_CH1                                 |          |          |           
PB7 , // |AUDIO_SDA [WM8994ECS/R_SDA]            |+SDA|    |    |+SDA|     |     |     |     |     |     |*RX   |      |      |      |     |*TIM4_CH2                                 |          |          |           
PB8 , // |ARDUINO SCL/D15                        |*SCL|    |    |*SCL|     |     |     |     |     |     |      |      |      |      |     |*TIM10_CH1 *TIM4_CH3                      |          |          |           
PB9 , // |ARDUINO SDA/D14                        |*SDA|    |    |*SDA|     |     |     |     |     |     |      |      |      |      |     |*TIM11_CH1 *TIM4_CH4                      |          |          |           
PB10, // |ULPI_D3 [USB3320C-EZK_D3]              |    |+SCL|    |    |     |+SCK |     |     |     |     |      |      |+TX   |      |     |+TIM2_CH3                                 |          |          |           
PB11, // |ULPI_D4 [USB3320C-EZK_D4]              |    |+SDA|    |    |     |     |     |     |     |     |      |      |+RX   |      |     |+TIM2_CH4                                 |          |          |           
PB12, // |ULPI_D5 [USB3320C-EZK_D5]              |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PB13, // |ULPI_D6 [USB3320C-EZK_D6]              |    |    |    |    |     |+SCK |     |     |     |     |      |      |      |      |     |*TIM1_CH1N                                |          |          |           
PB14, // |ARDUINO MISO/D12                       |    |    |    |    |     |+MISO|     |     |     |     |+TX   |      |      |      |     |+TIM12_CH1 +TIM8_CH2N +TIM1_CH2N          |*OTG_HS_DM|          |           
PB15, // |ARDUINO MOSI/PWM/D11                   |    |    |    |    |     |+MOSI|     |     |     |     |+RX   |      |      |      |     |+TIM12_CH2 +TIM1_CH3N +TIM8_CH3N          |*OTG_HS_DP|          |           
PC0 , // |ULPI_STP [USB3320C-EZK_STP]            |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN10|                                          |          |          |           
PC1 , // |RMII_MDC [LAN8742A-CZ-TR_MDC]          |    |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |*IN11|                                          |          |          |+TRACED0   
PC2 , // |ARD_A2                                 |    |    |    |    |     |+MISO|     |     |     |     |      |      |      |      |*IN12|                                          |          |          |           
PC3 , // |                                       |    |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |*IN13|                                          |          |          |           
PC4 , // |RMII_RXD0 [LAN8742A-CZ-TR_RXD0]        |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN14|                                          |          |          |           
PC5 , // |RMII_RXD1 [LAN8742A-CZ-TR_RXD1]        |    |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN15|                                          |          |          |           
PC6 , // |ARDUINO TX/D1                          |    |    |    |    |     |     |     |     |     |     |      |      |      |+TX   |     |+TIM8_CH1 +TIM3_CH1                       |          |          |           
PC7 , // |ARD_D0/RX                              |    |    |    |    |     |     |     |     |     |     |      |      |      |+RX   |     |+TIM8_CH2 +TIM3_CH2                       |          |          |           
PC8 , // |ARD_D5/PWM                             |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM3_CH3 +TIM8_CH3                       |          |          |+TRACED1   
PC9 , // |QSPI_D0 [N25Q128A13EF840E_DQ0]         |    |    |*SDA|    |     |     |     |     |     |     |      |      |      |      |     |+TIM8_CH4 *TIM3_CH4                       |          |          |           
PC10, // |QSPI_D1 [MT25QL512ABB1EW9_DQ1]         |    |    |    |    |     |     |+SCK |     |     |     |      |      |*TX   |      |     |                                          |          |          |           
PC11, // |DFSDM_DATIN5 [TP5]                     |    |    |    |    |     |     |+MISO|     |     |     |      |      |*RX   |      |     |                                          |          |          |           
PC12, // |WIFI_RX                                |    |    |    |    |     |     |+MOSI|     |     |     |      |      |      |      |     |                                          |          |          |*TRACED3   
PC13, // |                                       |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PC14, // |RCC_OSC32_IN                           |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*OSC32_IN |           
PC15, // |RCC_OSC32_OUT                          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*OSC32_OUT|           
PD0 , // |FMC_D2 [MT48LC4M32B2B5-6A_DQ2]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD1 , // |FMC_D3 [MT48LC4M32B2B5-6A_DQ3]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD2 , // |WIFI_TX                                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |+TRACED2   
PD3 , // |DFSDM_CKOUT [TP102]                    |    |    |    |    |     |+SCK |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD4 , // |OTG_FS_OverCurrent [STMPS2141STR_Fault]|    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD5 , // |RMII_RXER[LAN8742A-CZ-TR_RXERR]        |    |    |    |    |     |     |     |     |     |     |      |*TX   |      |      |     |                                          |          |          |           
PD6 , // |uSD_CLK                                |    |    |    |    |     |     |+MOSI|     |     |     |      |*RX   |      |      |     |                                          |          |          |           
PD7 , // |uSD_CMD                                |    |    |    |    |+MOSI|     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD8 , // |FMC_D13 [MT48LC4M32B2B5-6A_DQ13]       |    |    |    |    |     |     |     |     |     |     |      |      |+TX   |      |     |                                          |          |          |           
PD9 , // |FMC_D14 [MT48LC4M32B2B5-6A_DQ14]       |    |    |    |    |     |     |     |     |     |     |      |      |+RX   |      |     |                                          |          |          |           
PD10, // |FMC_D15 [MT48LC4M32B2B5-6A_DQ15]       |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD11, // |SPDIF_TX [TP20]                        |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PD12, // |AUDIO_SCL [WM8994ECS/R_SCLK]           |    |    |    |+SCL|     |     |     |     |     |     |      |      |      |      |     |+LPTIM1_IN1 +TIM4_CH1                     |          |          |           
PD13, // |QSPI_D3 [N25Q128A13EF840E_DQ3]         |    |    |    |+SDA|     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH2                                 |          |          |           
PD14, // |FMC_D0 [MT48LC4M32B2B5-6A_DQ0]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH3                                 |          |          |           
PD15, // |FMC_D1 [MT48LC4M32B2B5-6A_DQ1]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH4                                 |          |          |           
PE0 , // |FMC_NBL0 [MT48LC4M32B2B5-6A_DQM0]      |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PE1 , // |FMC_NBL1 [MT48LC4M32B2B5-6A_DQM1]      |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*LPTIM1_IN2                               |          |          |           
PE2 , // |QSPI_D2 [N25Q128A13EF840E_DQ2]         |    |    |    |    |     |     |     |*SCK |     |     |      |      |      |      |     |                                          |          |          |*TRACECLK  
PE3 , // |SAI1_SDB [WM8994ECS/R_ADCDAT1]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |*TRACED0   
PE4 , // |SAI1_FSA [WM8994ECS/R_LRCLK1]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |*TRACED1   
PE5 , // |SAI1_SCKA [WM8994ECS/R_BCLK1]          |    |    |    |    |     |     |     |*MISO|     |     |      |      |      |      |     |*TIM9_CH1                                 |          |          |*TRACED2   
PE6 , // |SAI1_SDA [WM8994ECS/R_DACDAT1]         |    |    |    |    |     |     |     |*MOSI|     |     |      |      |      |      |     |*TIM9_CH2                                 |          |          |+TRACED3   
PE7 , // |FMC_D4 [MT48LC4M32B2B5-6A_DQ4]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PE8 , // |FMC_D5 [MT48LC4M32B2B5-6A_DQ5]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |          |           
PE9 , // |FMC_D6 [MT48LC4M32B2B5-6A_DQ6]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1                                 |          |          |           
PE10, // |FMC_D7 [MT48LC4M32B2B5-6A_DQ7]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH2N                                |          |          |           
PE11, // |FMC_D8 [MT48LC4M32B2B5-6A_DQ8]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH2                                 |          |          |           
PE12, // |FMC_D9 [MT48LC4M32B2B5-6A_DQ9]         |    |    |    |    |     |     |     |+SCK |     |     |      |      |      |      |     |+TIM1_CH3N                                |          |          |           
PE13, // |FMC_D10 [MT48LC4M32B2B5-6A_DQ10]       |    |    |    |    |     |     |     |+MISO|     |     |      |      |      |      |     |+TIM1_CH3                                 |          |          |           
PE14, // |FMC_D11 [MT48LC4M32B2B5-6A_DQ11]       |    |    |    |    |     |     |     |+MOSI|     |     |      |      |      |      |     |+TIM1_CH4                                 |          |          |           
PE15, // |FMC_D12 [MT48LC4M32B2B5-6A_DQ12]       |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF0 , // |FMC_A0 [MT48LC4M32B2B5-6A_A0]          |    |*SDA|    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF1 , // |FMC_A1 [MT48LC4M32B2B5-6A_A1]          |    |*SCL|    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF2 , // |FMC_A2 [MT48LC4M32B2B5-6A_A2]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF3 , // |FMC_A3 [MT48LC4M32B2B5-6A_A3]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF4 , // |FMC_A4 [MT48LC4M32B2B5-6A_A4]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF5 , // |FMC_A5 [MT48LC4M32B2B5-6A_A5]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF6 , // |ARD_D3/PWM                             |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM10_CH1                                |          |          |           
PF7 , // |ARD_D6/PWM                             |    |    |    |    |     |     |     |     |*SCK |     |      |      |      |      |     |+TIM11_CH1                                |          |          |           
PF8 , // |ARDUINO A3                             |    |    |    |    |     |     |     |     |*MISO|     |      |      |      |      |     |*TIM13_CH1                                |          |          |           
PF9 , // |ARDUINO A2                             |    |    |    |    |     |     |     |     |*MOSI|     |      |      |      |      |     |*TIM14_CH1                                |          |          |           
PF10, // |ARDUINO A1                             |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF11, // |FMC_SDNRAS [MT48LC4M32B2B5-6A_RAS]     |    |    |    |    |     |     |     |     |+MOSI|     |      |      |      |      |     |                                          |          |          |           
PF12, // |FMC_A6 [MT48LC4M32B2B5-6A_A6]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF13, // |FMC_A7 [MT48LC4M32B2B5-6A_A7]          |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF14, // |FMC_A8 [MT48LC4M32B2B5-6A_A8]          |    |    |    |+SCL|     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PF15, // |FMC_A9 [MT48LC4M32B2B5-6A_A9]          |    |    |    |+SDA|     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG0 , // |FMC_A10 [MT48LC4M32B2B5-6A_A10]        |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG1 , // |FMC_A11 [MT48LC4M32B2B5-6A_A11]        |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG2 , // |FMC_A12                                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG3 , // |EXT_SCL                                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG4 , // |FMC_BA0 [MT48LC4M32B2B5-6A_BA0]        |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG5 , // |FMC_BA1 [MT48LC4M32B2B5-6A_BA1]        |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG6 , // |EXT_SDA                                |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG7 , // |SAI1_MCLKA [WM8994ECS/R_MCLK1]         |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG8 , // |FMC_SDCLK [MT48LC4M32B2B5-6A_CLK]      |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG9 , // |uSD_D0                                 |    |    |    |    |+MISO|     |     |     |     |     |      |      |      |*RX   |     |                                          |          |          |           
PG10, // |uSD_D1                                 |    |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG11, // |RMII_TX_EN [LAN8742A-CZ-TR_TXEN]       |    |    |    |    |+SCK |     |     |     |     |     |      |      |      |      |     |                                          |          |          |           
PG12, // |SPDIF_RX [74LVC1G04SE_4]               |    |    |    |    |     |     |     |     |     |+MISO|      |      |      |      |     |*LPTIM1_IN1                               |          |          |           
